# 5.1 Introduction to pandas Data Structures

In [1]:
import pandas as pd
import numpy as np

obj = pd.Series([1,2,3])
obj

0    1
1    2
2    3
dtype: int64

In [5]:
obj.values

array([1, 2, 3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
obj2 = pd.Series([4, 7, -4, 9], index=['d','b','a','c'])
obj2

d    4
b    7
a   -4
c    9
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-4

In [10]:
obj2['d']=1
obj2

d    1
b    7
a   -4
c    9
dtype: int64

In [11]:
obj2[['a','b','c']]

a   -4
b    7
c    9
dtype: int64

In [12]:
obj2[obj2>2]

b    7
c    9
dtype: int64

In [13]:
obj2 *2

d     2
b    14
a    -8
c    18
dtype: int64

In [14]:
np.exp(obj2)

d       2.718282
b    1096.633158
a       0.018316
c    8103.083928
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio':3500, 'Texas':71000,'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj)

0    True
1    True
2    True
dtype: bool

In [21]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
obj3 + obj4

California         NaN
Ohio            7000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [25]:
obj

0    1
1    2
2    3
dtype: int64

In [26]:
# Series index can be altered in-place by assignment
obj.index = ['Bob', 'Steve', 'Jeff']
obj

Bob      1
Steve    2
Jeff     3
dtype: int64

### DataFrame

In [27]:
df = pd.DataFrame(obj4)
df

            population
state
California         NaN
Ohio            3500.0
Oregon         16000.0
Texas          71000.0

In [28]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
# If you specify a sequence of coulumns, the dataframe will be arranged in that order
pd.DataFrame(data, columns= ['year','state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index= ['one', 'two', 'three', 'four', 'five', 'six'])
frame2.index.name = 'index_name'
frame2

            year   state  pop debt
index_name
one         2000    Ohio  1.5  NaN
two         2001    Ohio  1.7  NaN
three       2002    Ohio  3.6  NaN
four        2001  Nevada  2.4  NaN
five        2002  Nevada  2.9  NaN
six         2003  Nevada  3.2  NaN

In [31]:
frame2['state']

index_name
one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [32]:
frame2.year

index_name
one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [33]:
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [34]:
frame2['debt'] = 16.5
frame2

            year   state  pop  debt
index_name
one         2000    Ohio  1.5  16.5
two         2001    Ohio  1.7  16.5
three       2002    Ohio  3.6  16.5
four        2001  Nevada  2.4  16.5
five        2002  Nevada  2.9  16.5
six         2003  Nevada  3.2  16.5

In [35]:
frame2['debt'] = np.arange(6)
frame2

            year   state  pop  debt
index_name
one         2000    Ohio  1.5     0
two         2001    Ohio  1.7     1
three       2002    Ohio  3.6     2
four        2001  Nevada  2.4     3
five        2002  Nevada  2.9     4
six         2003  Nevada  3.2     5

In [37]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

            year   state  pop  debt
index_name
one         2000    Ohio  1.5   NaN
two         2001    Ohio  1.7  -1.2
three       2002    Ohio  3.6   NaN
four        2001  Nevada  2.4  -1.5
five        2002  Nevada  2.9  -1.7
six         2003  Nevada  3.2   NaN

In [45]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

            year   state  pop  debt  eastern
index_name
one         2000    Ohio  1.5   NaN     True
two         2001    Ohio  1.7  -1.2     True
three       2002    Ohio  3.6   NaN     True
four        2001  Nevada  2.4  -1.5    False
five        2002  Nevada  2.9  -1.7    False
six         2003  Nevada  3.2   NaN    False

In [46]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [62]:
pop = {'Nevada': {2001:2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   NaN
2002     2.9   NaN
2000     NaN   1.5

In [48]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     NaN   3.6   1.5

In [49]:
pd.DataFrame(pop, index=['2001', '2002' ,'2003'])

      Nevada  Ohio
2001     NaN   NaN
2002     NaN   NaN
2003     NaN   NaN

In [56]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   NaN     2.4
2002   3.6     2.9

In [77]:
frame3.index.name='year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   NaN
2002      2.9   NaN
2000      NaN   1.5

In [59]:
frame3.values

array([[2.4, nan],
       [2.9, 3.6],
       [nan, 1.5]])

In [61]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [67]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [68]:
index[1:]

Index(['b', 'c'], dtype='object')

In [70]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [72]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [74]:
obj2.index is labels

True

In [79]:
frame3

state  Nevada  Ohio
year
2001      2.4   NaN
2002      2.9   NaN
2000      NaN   1.5

In [78]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [80]:
'Ohio' in frame3.columns

True

In [84]:
2001 in frame3.index

True

In [85]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# 5.2 Essential Functionality

### Reindexing

In [91]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [92]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [96]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [97]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [99]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [105]:
states = ['Texas', 'Ohio', 'California']
frame.reindex(columns=states)

   Texas  Ohio  California
a      1     0           2
c      4     3           5
d      7     6           8

In [106]:
frame.loc[['a', 'c', 'd'], states]

   Texas  Ohio  California
a      1     0           2
c      4     3           5
d      7     6           8

### Dropping Entries from an Axis

In [107]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [108]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [111]:
obj.drop(['d', 'c'], inplace=True)

In [112]:
obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [116]:
# drop with dataframe
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data.drop(['Ohio', 'Colorado']) # does not do 'inplace'

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [121]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, Selection and Filtering

In [122]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [123]:
obj['b']

1.0

In [124]:
obj[1]

1.0

In [125]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [126]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [128]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [129]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [130]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [132]:
obj['b':'c']=5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [133]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [135]:
data[['three', 'four']]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [137]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [138]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [141]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [165]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [143]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [146]:
data.loc['Colorado', :]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [147]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [148]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [149]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [150]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [160]:
data.iloc[:, :3][data.three > 3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [166]:
data.loc['Colorado', 'two']

5

In [167]:
data.at['Colorado', 'two']

5

### Integer Indexes

In [170]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [171]:
ser[1]

1.0

In [175]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [173]:
ser.iloc[1]

1.0

### Arithmetic and Data Alignment

In [185]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [186]:
s2

a    2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [187]:
s1+s2

a    9.4
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [189]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                   columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                   columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregeon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [190]:
df2

           b     d     e
Utah     0.0   1.0   2.0
Ohio     3.0   4.0   5.0
Texas    6.0   7.0   8.0
Oregeon  9.0  10.0  11.0

In [191]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregeon   NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### Arithmetic methods with fill values

In [193]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [194]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [196]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [197]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [198]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [199]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [200]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [201]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [203]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [204]:
arr[0]

array([0., 1., 2., 3.])

In [205]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [206]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregeon'])
series = frame.iloc[0]
frame

           b     d     e
Utah     0.0   1.0   2.0
Ohio     3.0   4.0   5.0
Texas    6.0   7.0   8.0
Oregeon  9.0  10.0  11.0

In [207]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [208]:
frame - series

           b    d    e
Utah     0.0  0.0  0.0
Ohio     3.0  3.0  3.0
Texas    6.0  6.0  6.0
Oregeon  9.0  9.0  9.0

In [209]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

           b   d     e   f
Utah     0.0 NaN   3.0 NaN
Ohio     3.0 NaN   6.0 NaN
Texas    6.0 NaN   9.0 NaN
Oregeon  9.0 NaN  12.0 NaN

In [211]:
series3 = frame['d']
frame

           b     d     e
Utah     0.0   1.0   2.0
Ohio     3.0   4.0   5.0
Texas    6.0   7.0   8.0
Oregeon  9.0  10.0  11.0

In [212]:
series3

Utah        1.0
Ohio        4.0
Texas       7.0
Oregeon    10.0
Name: d, dtype: float64

In [213]:
frame.sub(series3, axis='index')
# frame.sub(series3, axis=0)

           b    d    e
Utah    -1.0  0.0  1.0
Ohio    -1.0  0.0  1.0
Texas   -1.0  0.0  1.0
Oregeon -1.0  0.0  1.0

### Function Application and Mapping

In [214]:
frame = pd.DataFrame(np.random.randn(4, 3),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.080081  1.139791  1.303004
Ohio   -0.346705  0.641249  0.950546
Texas   0.233323  0.405525  0.978758
Oregon  1.759422  0.417952  2.056377

In [215]:
np.abs(frame)

               b         d         e
Utah    1.080081  1.139791  1.303004
Ohio    0.346705  0.641249  0.950546
Texas   0.233323  0.405525  0.978758
Oregon  1.759422  0.417952  2.056377

In [220]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.839502
d    0.734266
e    1.105832
dtype: float64

In [223]:
def f(x):
    return pd.Series([x.min(), x.max()],
                     index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.080081  0.405525  0.950546
max  1.759422  1.139791  2.056377

In [227]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d     e
Utah    -1.08  1.14  1.30
Ohio    -0.35  0.64  0.95
Texas    0.23  0.41  0.98
Oregon   1.76  0.42  2.06

In [228]:
frame['e'].map(format)

Utah      1.30
Ohio      0.95
Texas     0.98
Oregon    2.06
Name: e, dtype: object

### Sorting and Ranking

In [230]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [232]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [233]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [235]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [236]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [237]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [239]:
frame = pd.DataFrame({'b': [4, 7, -3, 2],
                      'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [240]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [241]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [245]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() # by deafult rank breaks ties by assigning each group the mean rank

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [246]:
# ranks can also be assigned according to the order in which they-re observed in the data
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [247]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [248]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [249]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axing Indexes with Duplicate Labels

In [251]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [252]:
obj.index.is_unique

False

In [255]:
obj['a']

a    0
a    1
dtype: int64

In [256]:
obj['c']

4

In [258]:
df = pd.DataFrame(np.random.randn(4, 3),
                  index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.936385  1.810285 -0.089749
a -0.961175  0.600696  1.028460
b  0.452797 -0.844019 -0.210302
b -1.692634  1.180189  1.633028

In [259]:
df.loc['b']

          0         1         2
b  0.452797 -0.844019 -0.210302
b -1.692634  1.180189  1.633028

### Sumarizing and Computing Descriptive Statistics

In [2]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [5]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [6]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [14]:
# accumulations
df.cumsum(axis=0)

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [15]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [17]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [19]:
import pandas_datareader.data as web

all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [20]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-01-11 -0.023249  0.000389 -0.009699 -0.022405
2021-01-12 -0.001396  0.004900 -0.011771 -0.011417
2021-01-13  0.016227 -0.017723  0.006560  0.004495
2021-01-14 -0.015127  0.016152 -0.015346 -0.008105
2021-01-15 -0.013731 -0.004497 -0.001737 -0.002293

In [22]:
returns['MSFT'].corr(returns['IBM'])

0.5462832186800414

In [23]:
returns['MSFT'].cov(returns['IBM'])

0.00015502779120324763

In [24]:
returns.MSFT.corr(returns.IBM)

0.5462832186800414

In [26]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.461181  0.713914  0.655421
IBM   0.461181  1.000000  0.546283  0.512873
MSFT  0.713914  0.546283  1.000000  0.777875
GOOG  0.655421  0.512873  0.777875  1.000000

In [27]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000361  0.000143  0.000236  0.000206
IBM   0.000143  0.000265  0.000155  0.000138
MSFT  0.000236  0.000155  0.000304  0.000225
GOOG  0.000206  0.000138  0.000225  0.000275

In [28]:
returns.corrwith(returns.IBM)

AAPL    0.461181
IBM     1.000000
MSFT    0.546283
GOOG    0.512873
dtype: float64

In [29]:
returns.corrwith(volume)

AAPL   -0.078444
IBM    -0.071713
MSFT   -0.085249
GOOG   -0.155645
dtype: float64

### Unique Values,  Value Counts, and Membership

In [39]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b','b', 'c', 'c'])

uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [40]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [41]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
a    3
c    3
dtype: int64

In [42]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [4]:
mask = obj.isin(['b', 'c'])
mask

0    False
1    False
2    False
dtype: bool

In [5]:
obj[mask]

Series([], dtype: int64)

In [12]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [15]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [18]:
result = data.apply(pd.value_counts)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0